<a href="https://colab.research.google.com/github/barkle2/Programming/blob/master/%5BPython%5D%20Tutorial/dash_graph.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
#!pip install dash

- import dash library

In [3]:
import dash
import dash_core_components as dcc
import dash_html_components as html
import plotly.express as px
import pandas as pd

csv 파일에서 DataFrame을 읽어온다

In [15]:
# csv 파일 읽어서 DataFrame 만들기
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Tutorial/%EA%B2%BD%EC%A0%9C%ED%99%9C%EB%8F%99%EC%9D%B8%EA%B5%AC%EC%A1%B0%EC%82%AC(utf-8-sig).csv')

In [17]:
df.shape

(41280, 17)

In [19]:
df.head(1)

   Unnamed: 0         TBL_NM  PRD_DE  ... C1      C1_NM C1_NM_ENG
0           0  연령별 경제활동인구 총괄  199906  ...  0  15세 이상 전체     Total

[1 rows x 17 columns]

- 그래프 그릴 때 필요한 컬럼만 추출

In [44]:
df = df[['PRD_DE', 'ITM_NM', 'C1_NM', 'DT']]

- YEAR, MONTH 컬럼을 추가한다

In [45]:
df['YEAR'] = df.PRD_DE.astype(str).str[:4]
df['MONTH'] = df.PRD_DE.astype(str).str[4:]

In [46]:
df.head()

   PRD_DE ITM_NM      C1_NM       DT  YEAR MONTH
0  199906     인구  15세 이상 전체  35737.0  1999    06
1  199907     인구  15세 이상 전체  35779.0  1999    07
2  199908     인구  15세 이상 전체  35815.0  1999    08
3  199909     인구  15세 이상 전체  35849.0  1999    09
4  199910     인구  15세 이상 전체  35885.0  1999    10

- Dropdown에 입력할 리스트 생성

In [48]:
itm_list = df.ITM_NM.unique()
age_list = df.C1_NM.unique()
year_list = df.YEAR.unique()